<?php

use Illuminate\Database\Seeder;

class AdministrativeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $meestIds = [
            '(**id**, \'1017310\', \'Новокодацкий район\', \'Новокодацький район\', \'Ленинский район\', \'Ленінський район\', NULL, \'2020-04-29 09:38:07\', \'2020-04-29 09:38:07\'),
	(**id**, \'1030097\', \'Амур-Нижнеднепровский район\', \'Амур-Нижньодніпровський район\', NULL, NULL, NULL, \'2020-04-29 09:38:08\', \'2020-04-29 09:38:08\'),
	(**id**, \'1209149\', \'Самарский район\', \'Самарський район\', NULL, NULL, NULL, \'2020-04-29 09:38:09\', \'2020-04-29 09:38:09\'),
	(**id**, \'1209150\', \'Соборный район\', \'Соборний район\', \'Жовтневый район\', \'Жовтневий район\', NULL, \'2020-04-29 09:38:10\', \'2020-04-29 09:38:10\'),
	(**id**, \'1209151\', \'Шевченковский район\', \'Шевченківський район\', \'Бабушкинский район\', \'Бабушкінський район\', NULL, \'2020-04-29 09:38:11\', \'2020-04-29 09:38:11\'),
	(**id**, \'1209152\', \'Чечеловский район\', \'Чечелівський район\', \'Красногвардейский район\', \'Красногвардійський район\', NULL, \'2020-04-29 09:38:12\', \'2020-04-29 09:38:12\'),
	(**id**, \'1209153\', \'Индустриальный район\', \'Індустріальний район\', NULL, NULL, NULL, \'2020-04-29 09:38:13\', \'2020-04-29 09:38:13\'),
	(**id**, \'1209154\', \'Центральный район\', \'Центральний район\', \'Кировский район\', \'Кіровський район\', NULL, \'2020-04-29 09:38:14\', \'2020-04-29 09:38:14\');' => '50c5951b-749b-11df-b112-00215aee3ebe',
            '(**id**, \'2692158\', \'Королёвский район\', \'Корольовський район\', NULL, NULL, NULL, \'2020-04-29 14:56:43\', \'2020-04-29 14:56:45\'),
	(**id**, \'2692157\', \'Богунский район\', \'Богунський район\', NULL, NULL, NULL, \'2020-04-29 14:56:44\', \'2020-04-29 14:56:46\')' => '56bdd203-749b-11df-b112-00215aee3ebe',
            '(**id**, \'2825875\', \'Александровский район\', \'Олександрівський район\', \'Октябрьский район\', \'Жовтневий район\', NULL, \'2020-04-29 09:39:20\', \'2020-04-29 09:39:20\'),
	(**id**, \'2825876\', \'Заводской район\', \'Заводський район\', NULL, NULL, NULL, \'2020-04-29 09:39:21\', \'2020-04-29 09:39:21\'),
	(**id**, \'2825877\', \'Коммунарский район\', \'Комунарський район\', NULL, NULL, NULL, \'2020-04-29 09:39:22\', \'2020-04-29 09:39:22\'),
	(**id**, \'2825878\', \'Днепровский район\', \'Дніпровський район\', \'Ленинский район\', \'Ленінський район\', NULL, \'2020-04-29 09:39:23\', \'2020-04-29 09:39:23\'),
	(**id**, \'2825879\', \'Вознесеновский район\', \'Вознесенівський район\', \'Орджоникидзевский район\', \'Орджонікідзевський район\', NULL, \'2020-04-29 09:39:24\', \'2020-04-29 09:39:24\'),
	(**id**, \'2825880\', \'Хортицкий район\', \'Хортицький район\', NULL, NULL, NULL, \'2020-04-29 09:39:25\', \'2020-04-29 09:39:25\'),
	(**id**, \'2825881\', \'Шевченковский район\', \'Шевченківський район\', NULL, NULL, NULL, \'2020-04-29 09:39:26\', \'2020-04-29 09:39:26\');' => '56bdd4c6-749b-11df-b112-00215aee3ebe',
            '(**id**, \'7308547\', \'Южный район\', \'Південний район\', NULL, NULL, NULL, \'2020-04-29 09:40:22\', \'2020-04-29 09:40:22\'),
	(**id**, \'7308548\', \'Заводской район\', \'Заводський район\', NULL, NULL, NULL, \'2020-04-29 09:40:23\', \'2020-04-29 09:40:23\'),
	(**id**, \'7308549\', \'Днепровский район\', \'Дніпровський район\', NULL, NULL, NULL, \'2020-04-29 09:40:24\', \'2020-04-29 09:40:24\');' => '50c59518-749b-11df-b112-00215aee3ebe',
            '(**id**, \'1754513\', \'Голосеевский район\', \'Голосіївський район\', NULL, NULL, NULL, \'2020-04-29 09:38:27\', \'2020-04-29 09:38:27\'),
	(**id**, \'1754514\', \'Соломянский район\', \'Солом’янський район\', NULL, NULL, NULL, \'2020-04-29 09:38:28\', \'2020-04-29 09:38:28\'),
	(**id**, \'1754751\', \'Святошинский район\', \'Святошинський район\', NULL, NULL, NULL, \'2020-04-29 09:38:29\', \'2020-04-29 09:38:29\'),
	(**id**, \'1754757\', \'Дарницкий район\', \'Дарницький район\', NULL, NULL, NULL, \'2020-04-29 09:38:30\', \'2020-04-29 09:38:30\'),
	(**id**, \'1754781\', \'Днепровский район\', \'Дніпровський район\', NULL, NULL, NULL, \'2020-04-29 09:38:31\', \'2020-04-29 09:38:31\'),
	(**id**, \'1754820\', \'Деснянский район\', \'Деснянський район\', NULL, NULL, NULL, \'2020-04-29 09:38:32\', \'2020-04-29 09:38:32\'),
	(**id**, \'1754928\', \'Оболонский район\', \'Оболонський район\', NULL, NULL, NULL, \'2020-04-29 09:38:33\', \'2020-04-29 09:38:33\'),
	(**id**, \'1754975\', \'Подольский район\', \'Подільський район\', NULL, NULL, NULL, \'2020-04-29 09:38:34\', \'2020-04-29 09:38:34\'),
	(**id**, \'1755013\', \'Печерский район\', \'Печерський район\', NULL, NULL, NULL, \'2020-04-29 09:38:35\', \'2020-04-29 09:38:35\'),
	(**id**, \'1755014\', \'Шевченковский район\', \'Шевченківський район\', NULL, NULL, NULL, \'2020-04-29 09:38:36\', \'2020-04-29 09:38:36\');' => '5cb61671-749b-11df-b112-00215aee3ebe',
            '(**id**, \'7305159\', \'Крюківський район\', \'Крюківський район\', NULL, NULL, NULL, \'2020-04-29 09:40:20\', \'2020-04-29 09:40:20\'),
	(**id**, \'7305160\', \'Автозаводской район\', \'Автозаводський район\', NULL, NULL, NULL, \'2020-04-29 09:40:21\', \'2020-04-29 09:40:21\');' => '2e1bd8f3-19fe-11df-b41f-00215aee3ebe',
            '(**id**, \'1827568\', \'Ингулецкий район\', \'Інгулецький район\', NULL, NULL, NULL, \'2020-04-29 09:38:37\', \'2020-04-29 09:38:37\'),
	(**id**, \'1827708\', \'Металлургический район\', \'Металургійний район\', \'Дзержинский район\', \'Дзержинський район\', NULL, \'2020-04-29 09:38:38\', \'2020-04-29 09:38:38\'),
	(**id**, \'1827709\', \'Долгинцевский район\', \'Довгинцівський район\', NULL, NULL, NULL, \'2020-04-29 09:38:39\', \'2020-04-29 09:38:39\'),
	(**id**, \'1827710\', \'Покровский район\', \'Покровський район\', \'Октябрьский район\', \'Жовтневий район\', NULL, \'2020-04-29 09:38:40\', \'2020-04-29 09:38:40\'),
	(**id**, \'1827711\', \'Саксаганский район\', \'Саксаганський район\', NULL, NULL, NULL, \'2020-04-29 09:38:41\', \'2020-04-29 09:38:41\'),
	(**id**, \'1827712\', \'Терновской район\', \'Тернівський район\', NULL, NULL, NULL, \'2020-04-29 09:38:42\', \'2020-04-29 09:38:42\'),
	(**id**, \'1827713\', \'Центрально-Городской район\', \'Центрально-Міський район\', NULL, NULL, NULL, \'2020-04-29 09:38:43\', \'2020-04-29 09:38:43\');' => '62c3cda0-749b-11df-b112-00215aee3ebe',
            '(**id**, \'2825229\', \'Крепостной район\', \'Фортечний район\', \'Кировский район\', \'Кіровський район\', NULL, \'2020-04-29 09:39:14\', \'2020-04-29 09:39:14\'),
	(**id**, \'2825230\', \'Подольский район\', \'Подільський район\', \'Ленинский район\', \'Ленінський район\', NULL, \'2020-04-29 09:39:15\', \'2020-04-29 09:39:15\');' => '5cb61730-749b-11df-b112-00215aee3ebe',
            '(**id**, \'2123677\', \'Галицкий район\', \'Галицький район\', NULL, NULL, NULL, \'2020-04-29 09:38:44\', \'2020-04-29 09:38:44\'),
	(**id**, \'2126564\', \'Лычаковский район\', \'Личаківський район\', NULL, NULL, NULL, \'2020-04-29 09:38:45\', \'2020-04-29 09:38:45\'),
	(**id**, \'2126575\', \'Сиховский район\', \'Сихівський район\', NULL, NULL, NULL, \'2020-04-29 09:38:46\', \'2020-04-29 09:38:46\'),
	(**id**, \'2126586\', \'Франковский район\', \'Франківський район\', NULL, NULL, NULL, \'2020-04-29 09:38:47\', \'2020-04-29 09:38:47\'),
	(**id**, \'2128327\', \'Железнодорожный район\', \'Залізничний район\', NULL, NULL, NULL, \'2020-04-29 09:38:48\', \'2020-04-29 09:38:48\'),
	(**id**, \'2128329\', \'Шевченковский район\', \'Шевченківський район\', NULL, NULL, NULL, \'2020-04-29 09:38:49\', \'2020-04-29 09:38:49\');' => '62c3d54a-749b-11df-b112-00215aee3ebe',
            '(**id**, \'4045786\', \'Кальмиусский район\', \'Кальміуський район\', NULL, NULL, NULL, \'2020-04-29 09:39:54\', \'2020-04-29 09:39:54\'),
	(**id**, \'4045787\', \'Центральный район\', \'Центральний район\', NULL, NULL, NULL, \'2020-04-29 09:39:55\', \'2020-04-29 09:39:55\'),
	(**id**, \'4045788\', \'Левобережный район\', \'Лівобережний район\', NULL, NULL, NULL, \'2020-04-29 09:39:56\', \'2020-04-29 09:39:56\'),
	(**id**, \'4045789\', \'Приморский район\', \'Приморський район\', NULL, NULL, NULL, \'2020-04-29 09:39:57\', \'2020-04-29 09:39:57\');' => '68cf2588-749b-11df-b112-00215aee3ebe',
            '(**id**, \'2464737\', \'Центральный район\', \'Центральний район\', NULL, NULL, NULL, \'2020-04-29 09:38:56\', \'2020-04-29 09:38:56\'),
	(**id**, \'2464844\', \'Заводской район\', \'Заводський район\', NULL, NULL, NULL, \'2020-04-29 09:38:57\', \'2020-04-29 09:38:57\'),
	(**id**, \'2523802\', \'Ингульский район\', \'Інгульський район\', \'Ленинский район\', \'Ленінський район\', NULL, \'2020-04-29 09:38:58\', \'2020-04-29 09:38:58\'),
	(**id**, \'2523805\', \'Корабельный район\', \'Корабельний район\', NULL, NULL, NULL, \'2020-04-29 09:38:59\', \'2020-04-29 09:38:59\');' => '68cf2798-749b-11df-b112-00215aee3ebe',
            '(**id**, \'2944314\', \'Киевский район\', \'Київський район\', NULL, NULL, NULL, \'2020-04-29 09:39:36\', \'2020-04-29 09:39:36\'),
	(**id**, \'2945922\', \'Малиновский район\', \'Малиновський район\', NULL, NULL, NULL, \'2020-04-29 09:39:37\', \'2020-04-29 09:39:37\'),
	(**id**, \'2952493\', \'Приморский район\', \'Приморський район\', NULL, NULL, NULL, \'2020-04-29 09:39:38\', \'2020-04-29 09:39:38\'),
	(**id**, \'2952559\', \'Суворовский район\', \'Суворовський район\', NULL, NULL, NULL, \'2020-04-29 09:39:39\', \'2020-04-29 09:39:39\');' => '6ed81d37-749b-11df-b112-00215aee3ebe',
            '(**id**, \'2236567\', \'Киевский район\', \'Київський район\', NULL, NULL, NULL, \'2020-04-29 09:38:50\', \'2020-04-29 09:38:50\'),
	(**id**, \'2236568\', \'Подольский район\', \'Подільський район\', \'Ленинский район\', \'Ленінський район\', NULL, \'2020-04-29 09:38:51\', \'2020-04-29 09:38:51\'),
	(**id**, \'2236569\', \'Шевченковский район\', \'Шевченківський район\', \'Октябрьский район\', \'Октябрський район\', NULL, \'2020-04-29 09:38:52\', \'2020-04-29 09:38:52\');' => '74dc4d38-749b-11df-b112-00215aee3ebe',
            '(**id**, \'4045817\', \'Заречный район\', \'Зарічний район\', NULL, NULL, NULL, \'2020-04-29 09:39:58\', \'2020-04-29 09:39:58\'),
	(**id**, \'4045818\', \'Ковпаковский район\', \'Ковпаківський район\', NULL, NULL, NULL, \'2020-04-29 09:39:59\', \'2020-04-29 09:39:59\');' => '80f55a5e-749b-11df-b112-00215aee3ebe',
//            '(**id**, \'5848611\', \'Ахрамеевка микрорайон\', \'Ахрамєєвка мікрорайон\', NULL, NULL, NULL, \'2020-04-29 09:40:07\', \'2020-04-29 09:40:07\'),
//	(**id**, \'5848612\', \'Железнодорожный микрорайон\', \'Залізничний мікрорайон\', NULL, NULL, NULL, \'2020-04-29 09:40:08\', \'2020-04-29 09:40:08\'),
//	(**id**, \'5848613\', \'Калининский микрорайон\', \'Калінінський мікрорайон\', NULL, NULL, NULL, \'2020-04-29 09:40:09\', \'2020-04-29 09:40:09\'),
//	(**id**, \'5848614\', \'Короленко микрорайон\', \'Короленка мікрорайон\', NULL, NULL, NULL, \'2020-04-29 09:40:10\', \'2020-04-29 09:40:10\'),
//	(**id**, \'5848615\', \'Кузнечный микрорайон\', \'Ковальський мікрорайон\', NULL, \'Центрокуз\', NULL, \'2020-04-29 09:40:11\', \'2020-04-29 09:40:11\'),
//	(**id**, \'5848616\', \'Левобережный микрорайон\', \'Лівобережний мікрорайон\', NULL, NULL, NULL, \'2020-04-29 09:40:12\', \'2020-04-29 09:40:12\'),
//	(**id**, \'5848617\', \'Рижок микрорайон\', \'Ріжок мікрорайон\', NULL, NULL, NULL, \'2020-04-29 09:40:13\', \'2020-04-29 09:40:13\'),
//	(**id**, \'5848618\', \'Центральный микрорайон\', \'Центральний мікрорайон\', NULL, NULL, NULL, \'2020-04-29 09:40:14\', \'2020-04-29 09:40:14\');' => '80f55d31-749b-11df-b112-00215aee3ebe',
            '(**id**, \'3796255\', \'Шевченковский район\', \'Шевченківський район\', \'Дзержинский район\', \'Дзержинський район\', NULL, \'2020-04-29 09:39:45\', \'2020-04-29 09:39:45\'),
	(**id**, \'3801249\', \'Холодногорский район\', \'Холодногірський район\', \'Ленинский район\', \'Ленінський район\', NULL, \'2020-04-29 09:39:46\', \'2020-04-29 09:39:46\'),
	(**id**, \'3801278\', \'Новобаварский район\', \'Новобаварський район\', \'Октябрьский район\', \'Жовтневий район\', NULL, \'2020-04-29 09:39:47\', \'2020-04-29 09:39:47\'),
	(**id**, \'3801315\', \'Основянский район\', \'Основ’янський район\', \'Червонозаводский район\', \'Червонозаводський район\', NULL, \'2020-04-29 09:39:48\', \'2020-04-29 09:39:48\'),
	(**id**, \'7340969\', \'Індустриальний район\', \'Індустріальний район\', \'Орджоникидзевский район\', \'Орджонікідзевський район\', NULL, \'2020-04-29 09:40:32\', \'2020-04-29 09:40:32\'),
	(**id**, \'7340970\', \'Слободский район\', \'Слобідський район\', \'Коминтерновский район\', \'Комінтернівський район\', NULL, \'2020-04-29 09:40:33\', \'2020-04-29 09:40:33\'),
	(**id**, \'7340971\', \'Московский район\', \'Московський район\', NULL, NULL, NULL, \'2020-04-29 09:40:34\', \'2020-04-29 09:40:34\'),
	(**id**, \'7340972\', \'Немишлянский район\', \'Немишлянський район\', \'Фрунзенский район\', \'Фрунзенський район\', NULL, \'2020-04-29 09:40:35\', \'2020-04-29 09:40:35\'),
	(**id**, \'7340973\', \'Киевский район\', \'Київський район\', NULL, NULL, NULL, \'2020-04-29 09:40:36\', \'2020-04-29 09:40:36\');' => '87162365-749b-11df-b112-00215aee3ebe',
            '(**id**, \'4251773\', \'Суворовский район\', \'Суворовський район\', NULL, NULL, NULL, \'2020-04-29 09:40:00\', \'2020-04-29 09:40:00\'),
	(**id**, \'4258125\', \'Днепровский район\', \'Дніпровський район\', NULL, NULL, NULL, \'2020-04-29 09:40:01\', \'2020-04-29 09:40:01\'),
	(**id**, \'4259196\', \'Корабельний район\', \'Корабельний район\', \'Комсомольский район\', \'Комсомольський район\', NULL, \'2020-04-29 09:40:02\', \'2020-04-29 09:40:02\');' => '8716239a-749b-11df-b112-00215aee3ebe',
            '(**id**, \'2825509\', \'Приднепровский район\', \'Придніпровський район\', NULL, NULL, NULL, \'2020-04-29 09:39:18\', \'2020-04-29 09:39:18\'),
	(**id**, \'2825510\', \'Сосновский район\', \'Соснівський район\', NULL, NULL, NULL, \'2020-04-29 09:39:19\', \'2020-04-29 09:39:19\');' => '8716275b-749b-11df-b112-00215aee3ebe',
            '(**id**, \'2825365\', \'Деснянский район\', \'Деснянський район\', NULL, NULL, NULL, \'2020-04-29 09:39:16\', \'2020-04-29 09:39:16\'),
	(**id**, \'2825366\', \'Новозаводский район\', \'Новозаводський район\', NULL, NULL, NULL, \'2020-04-29 09:39:17\', \'2020-04-29 09:39:17\');' => '8716279f-749b-11df-b112-00215aee3ebe',
        ];

        foreach ($meestIds as $query => $meestId) {
            $city = \App\City::query()->where('uuid', '=', $meestId)->withTrashed()->first();
            if ($city) {
                \Illuminate\Support\Facades\DB::insert(\Illuminate\Support\Facades\DB::raw('INSERT INTO `administrative` (`city_id`, `osm_id`, `name_ru`, `name_uk`, `old_name_ru`, `old_name_uk`, `deleted_at`, `created_at`, `updated_at`) VALUES '
                    .str_replace('**id**', $city->id, $query)));
            }
        }
    }
}
