<?php

return [
    'owner_request' => 'Обращение владельца',
    'dis_photo' => 'Несоответствие фото',
    'dis_price' => 'Несоответствие цены',
    'dis_address' => 'Несоответствие адреса',
    'not_actual' => 'Объявление не актуально сдано/снято с рынка',
    'wrong_contacts' => 'Неверная контактная информация ',
    'fraud' => 'Мошенничество',
    'another' => 'Другая причина',
    'another_placeholder' => 'Укажите причину',
    'bad_photos' => 'Фотографии не соответствуют требованиям',
    'object_done' => 'Объект сдан',
    'contacts_dont_respond' => 'Невозможность связаться по контактным данным',
    'comment' => 'Комментарий',
    'want_money' => 'Взымание платы за посреднические услуги',

    'success_moderate' => 'Объявление успешно прошло модерацию',
    'rejected_moderate' => 'ббъявление было отклонено',
    'admin_enabled_advert' => 'Администратор разблокировал объявление',
    'admin_blocked_advert' => 'Администратор заблокировал объявление',

    'admin_block_user' => 'Администратор заблокировал Ваш аккаунт',
    'admin_block_user_all_adverts' => 'Администратор заблокировал Ваш аккаунт и все объявления',
    'admin_active_user' => 'Администратор разблокировал Ваш аккаунт',
    'admin_active_user_all_adverts' => 'Администратор разблокировал Ваш аккаунт и все объявления',
];
