<?php

return [
    'owner_request' => 'Звернення власника',
    'dis_photo' => 'Невідповідність фото',
    'dis_price' => 'Невідповідність ціни',
    'dis_address' => 'Невідповідність адреси',
    'not_actual' => 'Оголошення не актуальне здано / знято з ринку',
    'wrong_contacts' => 'Невірна контактна інформація ',
    'fraud' => 'Шахрайство',
    'another' => 'Інша причина',
    'another_placeholder' => 'Вкажіть причину',
    'bad_photos' => 'Фотографії не відповідають вимогам',
    'object_done' => 'Об\'єкт зданий',
    'contacts_dont_respond' => 'Неможливість зв\'язатися за контактними даними',
    'want_money' => 'Справляння плати за посередницькі послуги',

    'success_moderate' => 'Оголошення успішно пройшло модерацію',
    'rejected_moderate' => 'Оголошення було відхилено',
    'admin_enabled' => 'Адміністратор розблокував оголошення',
    'admin_blocked' => 'Адміністратор заблокував оголошення',

    'admin_block_user' => 'Адміністратор заблокував Ваш аккаунт',
    'admin_block_user_all_adverts' => 'Адміністратор заблокував Ваш аккаунт та всі оголошення',
    'admin_active_user' => 'Адміністратор разблокував Ваш аккаунт',
    'admin_active_user_all_adverts' => 'Адміністратор разблокував Ваш аккаунт та всі оголошення',
];
